Repository: tuankiet65/tracnghiem
Catalog: tracnghiem/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: Page not found
vi: Không tìm thấy trang yêu cầu

source: The page you're looking for does not exists.
vi: Chúng tôi không thể tìm thấy trang bạn yêu cầu.

source: Here's a cute Hatsune Miku because we like it.<br />Not really related, but whatever.
vi: Đây là Hatsune Miku vì chúng tôi thích vậy. <br />Cũng chẳng liên quan tới cái báo lỗi này đâu, mà thôi kệ.

source: Bad request
vi: Yêu cầu không đúng chuẩn

source: Your request couldn't be understood by the server.
vi: Máy chủ không thể hiểu yêu cầu của bạn.

source: Patchouli Knowledge is not happy that you might be doing nasty things to the server.
vi: Patchouli Knowledge có vẻ không vui lắm vì bạn đang táy máy gì đó với máy chủ thì phải.

source: Forbidden
vi: Tài nguyên cấm truy cập

source: You just tried to access something which you don't have the required permission to do so.
vi: Bạn không có quyền truy cập vào trang mà bạn đã yêu cầu.

source: Internal Server Error
vi: Lỗi máy chủ

source: The server encountered an internal error and was unable to complete your request.
vi: Máy chủ đã gặp lỗi trong quá trình hoàn thành yêu cầu của bạn.

source: Flandre Scarlet is sad because she couldn't fulfill this request <br />(don't worry though, we have been notified of this issue and will try to fix this issue as soon as possible)
vi: Flandre Scarlet đang rất buồn vì cô ấy không thể hoàn thành yêu cầu của bạn. <br />(Đừng lo, chúng tôi đã nhận được thông báo về việc này và sẽ khắc phục trong thời gian ngắn nhất)

source: Announcements
vi: Thông báo

source: Contest
vi: Cuộc thi

source: Login as
vi: Đăng nhập dưới danh nghĩa

source: Username
vi: Tên đăng nhập

source: Questions in set %(qset_name)s
vi: Câu hỏi trong bộ câu hỏi %(qset_name)s

source: Question Set
vi: Bộ câu hỏi

source: Reports
vi: Xuất báo cáo

source: Schools
vi: Trường

source: Index
vi: Trang chủ

source: Contests
vi: Cuộc thi

source: Question sets
vi: Bộ câu hỏi

source: Logout
vi: Đăng xuất

source: Question
vi: Câu hỏi

source: Unknown AJAX error: %(text_status)s %(error_thrown)s, please reload.
vi: Lỗi AJAX không xác định: %(text_status)s %(error_thrown)s, xin hãy tải lại trang.

source: Authentication failure
vi: Lỗi xác thực

source: Please login again
vi: Xin hãy đăng nhập lại

source: AJAX error: %(error)s, please reload.
vi: Lỗi AJAX: %(error)s, xin hãy tải lại trang.

source: You have finished your exam with score of %(score)d/%(questions_count)d
vi: Bạn đã hoàn thành bài thi của mình với số điểm %(score)d/%(questions_count)d

source: Congratulation
vi: Chúc mừng

source: Error
vi: Lỗi

source: We can't close your exam at the moment. Please try again in a few seconds.
vi: Chúng tôi không thể kết thúc bài làm của bạn vào thời điểm hiện tại. Xin hãy thử lại trong giây lát.

source: Do you want to close the exam? You still have time
vi: Bạn có muốn nộp bài hay không? Bạn vẫn còn thời gian làm bài.

source: Do you want to close the exam? You still have time and you have %(question)d questions unanswered
vi: Bạn có muốn nộp bài hay không? Bạn vẫn còn thời gian làm bài và còn %(question)d câu hỏi chưa trả lời.

source: Warning
vi: Cảnh báo

source: Please enter your old password
vi: Xin hãy nhập mật khẩu cũ của bạn

source: Your password is too weak
vi: Mật khẩu của bạn quá yếu

source: Password either is not the same or too weak
vi: Mật khẩu hoặc không khớp với ở trên hoặc quá yếu

source: Incorrect old password
vi: Mật khẩu cũ không khớp

source: Password changed successfully. You'll be logged out...
vi: Bạn đã đổi mật khẩu thành công. Bạn sẽ tự động đăng xuất trong giây lát.

source: Please fill in your name
vi: Xin hãy điền tên của bạn

source: Please choose your school
vi: Xin hãy chọn trường của bạn

source: Please fill in your class
vi: Xin hãy điền lớp của bạn

source: Profile edited successfully
vi: Thay đổi thông tin thành công

source: Error %(error_code)d (%(error_name)s)
vi: Lỗi %(error_code)d (%(error_name)s)

source: Error %(error_code)d
vi: Lỗi %(error_code)d

source: Exam
vi: Bài thi

source: Remaining time
vi: Thời gian làm bài còn lại

source: Answered questions
vi: Số câu hỏi đã trả lời

source: Saving your progress
vi: Đang lưu bài làm của bạn

source: Your progress was saved
vi: Bài làm của bạn đã được lưu

source: Error while saving your progress<br/>Trying...
vi: Gặp lỗi trong quá trình lưu bài làm<br/>Đang thử lại...

source: End exam
vi: Nộp bài

source: Closing exam
vi: Đang nộp bài

source: Announcement published at %(time)s
vi: Thông báo này được đăng vào lúc %(time)s

source: Statistics
vi: Thống kê

source: Account count:
vi: Số tài khoản đã đăng kí:

source: Exam count:
vi: Số bài thi đã làm:

source: Participate
vi: Tham gia thi

source: Password
vi: Mật khẩu

source: Install
vi: Cài đặt

source: minutes
vi: phút

source: seconds
vi: giây

source: Contest: <b>%(contest_title)s</b>
vi: Cuộc thi: <b>%(contest_title)s</b>

source: This contest starts from <b>%(begin_date)s</b> to <b>%(end_date)s</b>
vi: Cuộc thi này diễn ra từ ngày <b>%(begin_date)s</b> đến ngày <b>%(end_date)s</b>

source: Duration: <b>%(duration)d minutes</b>
vi: Thời gian làm bài: <b>%(duration)d phút</b>

source: Number of questions: <b>%(questions)d questions</b>
vi: Số câu hỏi: <b>%(questions)d câu hỏi</b>

source: Your last performance:
vi: Thành tích của bạn:

source: Attempt
vi: Lần thi

source: Start time
vi: Thời gian bắt đầu

source: End time
vi: Thời gian kết thúc

source: Status
vi: Trạng thái

source: Elapsed time
vi: Thời gian làm bài

source: Score
vi: Điểm

source: Finished
vi: Đã nộp bài

source: Ongoing
vi: Chưa nộp bài

source: Continue
vi: Tiếp tục làm bài

source: Participate in this contest
vi: Tham gia cuộc thi này

source: This contest has either ended or hasn't started
vi: Cuộc thi hoặc chưa bắt đầu hoặc đã kết thúc

source: Rules
vi: Thể lệ

source: Sign in or register
vi: Đăng nhập hoặc đăng kí

source: My profile
vi: Thông tin bản thân

source: Sign out
vi: Đăng xuất

source: Online quiz
vi: Thi 6 bài học LLCT

source: Online quiz Footer
vi: Thi tìm hiểu 6 Bài học lý luận chính trị dành cho Đoàn viên

source: Links
vi: Các đường dẫn

source: Running <b><a class="grey-text text-lighten-3" href="https://github.com/tuankiet65/tracnghiem">tuankiet65/tracnghiem</a></b> revision <b><a class="grey-text text-lighten-3" href="https://github.com/tuankiet65/tracnghiem/tree/%(rev)s">%(rev)s</a></b>. Current timezone: <b>%(timezone)s</b>
vi: Đang chạy <b><a class="grey-text text-lighten-3" href="https://github.com/tuankiet65/tracnghiem">tuankiet65/tracnghiem</a></b> phiên bản <b><a class="grey-text text-lighten-3" href="https://github.com/tuankiet65/tracnghiem/tree/%(rev)s">%(rev)s</a></b>. Múi giờ hiện tại: <b>%(timezone)s</b>

source: Yourself
vi: Bản thân

source: Your profile
vi: Thông tin về bạn

source: Edit your profile
vi: Sửa thông tin bản thân

source: Change your password
vi: Thay đổi mật khẩu

source: Name
vi: Họ và tên

source: School
vi: Trường

source: Class
vi: Lớp

source: Your past results
vi: Các kết quả thi của bạn

source: Your name
vi: Tên thật của bạn

source: Your school
vi: Trường của bạn

source: Your class
vi: Lớp của bạn

source: Edit profile
vi: Sửa thông tin

source: Old password
vi: Mật khẩu cũ

source: New password
vi: Mật khẩu mới

source: New password (repeat)
vi: Mật khẩu mới (lặp lại)

source: Change password
vi: Đổi mật khẩu

source: Authentication
vi: Xác thực

source: Error:
vi: Lỗi:

source: You need to login to proceed
vi: Bạn cần phải đăng nhập để tiếp tục

source: Login
vi: Đăng nhập

source: Register
vi: Đăng kí

source: Your username
vi: Tên đăng nhập

source: Your password
vi: Mật khẩu

source: Don't have an account? Register
vi: Bạn chưa có tài khoản? Đăng kí

source: Incorrect login information, please try again
vi: Thông tin đăng nhập không chính xác, hãy thử lại

source: Password (repeat)
vi: Nhập lại mật khẩu mới

source: Choose your school
vi: Hãy chọn trường của bạn

source: Please wait for all resources to be loaded
vi: Xin hãy chờ cho các tài nguyên được tải về

source: Log in to your existing account
vi: Đăng nhập vào tài khoản hiện có

source: Please fill in your username
vi: Xin hãy nhập tên đăng nhập

source: An account with the same username exists, please choose another username
vi: Có một tài khoản khác cùng tên đăng nhập với bạn, hãy chọn tên đăng nhập khác.

source: You haven't filled in some fields, maybe you haven't checked the captcha?
vi: Bạn chưa điền hết tất cả các trường, có lẽ bạn chưa đánh dấu xác nhận ở dưới cùng?
